# config.py

# === Начальный статус игрока ===
STATUS_DATA = {
    "Здоровье": 100,
    "Энергия": 100,
    "Голод": 0,
    "Настроение": 50
}

# === Инвентарь по умолчанию ===
INVENTORY = [
    "Хлеб",
    "Фляга с водой",
    "Меч новичка",
    "Факел"
]

# === Имена NPC ===
NPC_NAMES = [
    "Гарольд с дробовиком",
    "Лягушка Фроггит",
    "Дракула",
    "Торговец",
    "Лань",
    "Лесник"
]

# === Возможные локации ===
LOCATIONS = [
    "Зачарованный лес",
    "Проклятая деревня",
    "Пещера забвения",
    "Замок",
    "Город теней"
    "Храм говна"
]

LOCATION_DESCRIPTIONS = {
    "ХУЙ": "Описание для ХУЙ",
    "ГОВНО": "Описание для ГОВНО"
}


# === Варианты диалогов (по желанию, если пригодятся) ===
DIALOGUES = [
    "Приветствую тебя, странник.",
    "Ты не видел мой амулет?",
    "Берегись чудовищ в этих землях.",
    "Твоя аура тёмная... будь осторожен.",
    "Помоги мне — и я щедро вознагражу тебя."
]

TEXT_COLORS = {
    "system": "light gray",
    "dialogue": "cyan",
    "event": "orange",
    "npc": "yellow",
    "combat": "red",
    "item": "light green",
    "location": "light blue",
    "inventory": "white",
    "default": "white"
}


# === Задержка в миллисекундах при входе в локацию ===
ENTER_DELAY_MS = 5000
# 
ENCOUNTER_CHANCE = 50